Revit 2026 API

# IFCDataAsDouble Method

---

Gets storage value as double when its PrimitiveType is double.

**Namespace:** Autodesk.Revit.DB.IFC**Assembly:** RevitAPIIFC (in RevitAPIIFC.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public double AsDouble()
```
```vb
Public Function AsDouble As Double
```
```cpp
public:
double AsDouble()
```
```fsharp
member AsDouble : unit -> float
```

#### Return Value

Double The double value.

| Exception | Condition |
| --- | --- |
| InapplicableDataException | The primitive type is not double. |

#### Reference

IFCData Class

Autodesk.Revit.DB.IFC Namespace